#include <windows.h>
#include <stdio.h>
#include <iostream>
#include <iomanip>
#include <string>
#include <sstream>
#include <fstream>
#include <vector>
using namespace std;

#define SECTOR_SIZE 512
#define COL 100

struct atribute
{
    int read_only;
    int hidden;
    int system;
    int vollabel;
    int directory;
    int archive;
};

struct BootSector {
    unsigned short bytesPerSector; // 0xB
    unsigned short sectorsPerCluster; // 0xD
    unsigned short reservedSectors; // 0xE
    unsigned short numFATs; // 0x10
    unsigned int totalSectors; // 0x20
    unsigned int sectorsPerFAT; // 0x24
    unsigned int clusterNumberRDET; // 0x2C
    unsigned short sectorNumberFileSystem; // 0x30
    unsigned short sectorNumberBackupBoot; // 0x32


    //.......
};
int spc = 0;

atribute readatr(string atri)
{
    atribute temp;
    temp.read_only = atri[7] & 1;
    temp.hidden = atri[6] & 1;
    temp.system = atri[5] & 1;
    temp.vollabel = atri[4] & 1;
    temp.directory = atri[3] & 1;
    temp.archive = atri[2] & 1;
    return temp;
}

string littleEdianConvert(BYTE sector[512], int offset, int byte) {
    stringstream builder;
    for (int i = byte - 1; i >= 0; i--) {
        builder << hex << setfill('0') << setw(2) << static_cast<int>(sector[offset + i]);
    }
    string result = builder.str();
    return result;
}

void getFieldValue(BootSector& curr, BYTE sector[512]) {
    string hexStr;
    hexStr = littleEdianConvert(sector, 0xB, 2);
    curr.bytesPerSector = (int)strtol(hexStr.c_str(), NULL, 16);

    curr.sectorsPerCluster = (int)sector[0xD];

    hexStr = littleEdianConvert(sector, 0xE, 2);
    curr.reservedSectors = (int)strtol(hexStr.c_str(), NULL, 16);

